[
  {
      "title": "Deckers Stock Jumps 11% on Strong Q2 Results",
      "date": "2024-10-25 10:42:00",
      "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/DECK\">Deckers (NYSE:DECK)</a> shares surged more than 11% intra-day today following the release of impressive second-quarter earnings that outpaced analyst expectations. The footwear company, known for its UGG and HOKA brands, also raised its full-year guidance, fueling investor optimism.</p>\n<p>For the quarter, Deckers reported adjusted earnings per share of $1.59, surpassing the expected $1.23. Revenue climbed 20.1% year-over-year to $1.31 billion, exceeding the $1.2 billion forecast.</p>\n<p>The HOKA brand led the charge, with sales soaring 34.7% to $570.9 million, while the UGG brand saw a solid 13% increase, reaching $689.9 million. Direct-to-consumer net sales rose 19.9% to $397.7 million, with comparable sales up 17%, reflecting robust demand across channels.</p>\n<p>Deckers’ gross margin improved to 55.9%, up from 53.4% in the same period last year, driven by enhanced pricing strategies and a favorable product mix.</p>\n<p>Looking forward, Deckers adjusted its fiscal 2025 outlook, now expecting revenue to grow approximately 12% to $4.8 billion, slightly below the $4.82 billion consensus. The company raised its EPS forecast to a range of $5.15 to $5.25, which is below the analysts’ expectations of $5.35.</p>",
      "tickers": "NYSE:DECK",
      "image": "https://cdn.financialmodelingprep.com/images/fmp-1729867330383.jpg",
      "link": "https://financialmodelingprep.com/market-news/fmp-deckers-stock-jumps-11-on-strong-q2-results",
      "author": "Davit Kirakosyan",
      "site": "Financial Modeling Prep"
  },
  {
      "title": "Skechers Shares Rise 5% on Strong Q3 Earnings and Upgraded Outlook",
      "date": "2024-10-25 10:40:00",
      "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/SKX\">Skechers USA (NYSE:SKX)</a> saw its shares soar 5% intra-day today after posting third-quarter earnings that surpassed Wall Street expectations and raising its full-year outlook. The footwear company’s impressive performance highlighted strong demand across global markets.</p>\n<p>For the third quarter, Skechers reported adjusted earnings per share of $1.20, exceeding Wall Street estimates of $1.16. Revenue reached a record $2.35 billion, up 15.9% year-over-year and topping the Street forecast of $2.31 billion. This growth was fueled by a 20.6% increase in wholesale sales and a 9.6% rise in direct-to-consumer sales.</p>\n<p>Looking ahead, Skechers raised its full-year 2024 revenue forecast to a range of $8.925 billion to $8.975 billion, exceeding its previous guidance and the Street consensus of $8.93 billion. The company also lifted its earnings per share projection to $4.20-$4.25, surpassing Wall Street’s expectation of $4.17.</p>",
      "tickers": "NYSE:SKX",
      "image": "https://cdn.financialmodelingprep.com/images/fmp-1729867217798.jpg",
      "link": "https://financialmodelingprep.com/market-news/fmp-skechers-shares-rise-5-on-strong-q3-earnings-and-upgraded-outlook",
      "author": "Davit Kirakosyan",
      "site": "Financial Modeling Prep"
  },
  {
      "title": "Coursera Shares Drop 7% on Disappointing Q4 Revenue Guidance Despite Strong Q3 Earnings",
      "date": "2024-10-25 10:38:00",
      "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/COUR\">Coursera (NYSE:COUR)</a> saw its shares plummet 7% intra-day on Wednesday after the online education platform issued a fourth-quarter revenue forecast that fell short of expectations, overshadowing its stronger-than-anticipated third-quarter results.</p>\n<p>For Q3, Coursera reported adjusted earnings per share of $0.10, beating the Street estimate of $0.02. Revenue for the quarter reached $176.1 million, a 6% year-over-year increase, surpassing the forecasted $173.98 million.</p>\n<p>However, Coursera's fourth-quarter revenue projection of $174-178 million came in well below the Street estimate of $186.6 million, raising concerns over slowing growth. The company also revised its full-year 2024 revenue outlook to $690-$694 million, down from its prior range of $695-$705 million, and below the consensus of $700 million.</p>\n<p>On a positive note, Coursera increased its full-year 2024 adjusted EBITDA margin forecast by 170 basis points to 5.4%. </p>",
      "tickers": "NYSE:COUR",
      "image": "https://cdn.financialmodelingprep.com/images/fmp-1729867109436.jpg",
      "link": "https://financialmodelingprep.com/market-news/fmp-coursera-shares-drop-7-on-disappointing-q4-revenue-guidance-despite-strong-q3-earnings",
      "author": "Davit Kirakosyan",
      "site": "Financial Modeling Prep"
  },
  {
      "title": "DexCom Shares Drop 2% as Slowing Revenue Growth Overshadows Q3 Earnings Beat",
      "date": "2024-10-25 10:37:00",
      "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/DXCM\">DexCom (NASDAQ:DXCM)</a> reported better-than-expected third-quarter earnings, but a sharp deceleration in revenue growth sent its shares falling 2%. The maker of continuous glucose monitoring systems posted adjusted earnings per share of $0.45, edging past the Street consensus of $0.43. Revenue came in at $994.2 million, slightly surpassing estimates of $990.44 million and representing a modest 2% year-over-year increase.</p>\n<p>While DexCom's results exceeded earnings projections, the slower revenue growth marked a significant departure from previous quarters and likely contributed to the market's negative response. In the U.S., revenue dipped by 2% year-over-year, while international sales provided a brighter spot with 12% growth.</p>\n<p>DexCom reaffirmed its full-year 2024 revenue guidance, projecting between $4.00 billion and $4.05 billion in revenue, compared to the Street expectations of $4.01 billion and reflecting 11-13% organic growth. </p>",
      "tickers": "NASDAQ:DXCM",
      "image": "https://cdn.financialmodelingprep.com/images/fmp-1729867024285.jpg",
      "link": "https://financialmodelingprep.com/market-news/fmp-dexcom-shares-drop-2-as-slowing-revenue-growth-overshadows-q3-earnings-beat",
      "author": "Davit Kirakosyan",
      "site": "Financial Modeling Prep"
  },
  {
      "title": "Boston Beer Shares Drop 3% on Lowered Full-Year Guidance",
      "date": "2024-10-25 10:35:00",
      "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/SAM\">The Boston Beer Company (NYSE:SAM)</a> reported third-quarter earnings that exceeded analyst expectations, yet its full-year guidance fell short, leading to a 3% drop in shares intra-day today.</p>\n<p>The company posted adjusted earnings per share of $5.35, surpassing the Street estimate of $5.03. Revenue increased 0.6% year-over-year, reaching $605.5 million, just above the projected $605.14 million.</p>\n<p>However, Boston Beer lowered its full-year 2024 earnings guidance to a range of $8.00 to $10.00 per share, below the Street consensus of $9.58 at the midpoint, citing softer trends in the beverage category.</p>\n<p>In the third quarter, depletions, which measure sales to retailers, declined by 3%, and shipment volume fell by 1.9% to around 2.24 million barrels. Despite these declines, the company’s gross margin improved to 46.3%, up 60 basis points from the previous year, supported by price hikes and procurement efficiencies.</p>",
      "tickers": "NYSE:SAM",
      "image": "https://cdn.financialmodelingprep.com/images/fmp-1729866908618.jpg",
      "link": "https://financialmodelingprep.com/market-news/fmp-boston-beer-shares-drop-3-on-lowered-full-year-guidance",
      "author": "Davit Kirakosyan",
      "site": "Financial Modeling Prep"
  },
  {
    "title": "ResMed Shares Climb 8% on Strong Q1 Earnings and Margin Expansion",
    "date": "2024-10-25 10:33:00",
    "content": "<p><a href=\"https://financialmodelingprep.com/financial-summary/RMD\">ResMed (NYSE:RMD)</a> saw its shares rise 8% intra-day today following a robust first-quarter fiscal 2025 report that exceeded Street expectations. The sleep and respiratory care device maker posted adjusted earnings per share of $2.20 for the quarter, above the Street estimate of $2.05. Revenue increased by 11% year-over-year, reaching $1.22 billion and topping projections of $1.19 billion.</p>\n<p>ResMed’s operational focus contributed to notable margin gains, with gross margin expanding by 420 basis points to 58.6% and adjusted gross margin rising by 320 basis points to 59.2%. Income from operations also saw a substantial 34% increase compared to the same period last year.</p>",
    "tickers": "NYSE:RMD",
    "image": "https://cdn.financialmodelingprep.com/images/fmp-1729866823502.jpg",
    "link": "https://financialmodelingprep.com/market-news/fmp-resmed-shares-climb-8-on-strong-q1-earnings-and-margin-expansion",
    "author": "Davit Kirakosyan",
    "site": "Financial Modeling Prep"
},
{
    "title": "Asia Stocks Muted as Japanese Shares Decline Amid Election and Yen Concerns",
    "date": "2024-10-25 05:22:00",
    "content": "<p>Asian stock markets have shown a muted response recently, with Japanese shares in particular experiencing a dip due to mounting concerns around the upcoming election and the yen's ongoing fluctuations. Investors are increasingly cautious as political uncertainty in Japan and currency pressures affect both domestic and foreign investments.</p>\r\n<h3>Key Factors Influencing Asia’s Market Movement</h3>\r\n<h4>1. Japan's Upcoming Election</h4>\r\n<p>Political shifts in Japan play a significant role in the nation’s stock market performance. With an election on the horizon, investors are wary of potential policy changes that could impact everything from fiscal policy to corporate regulations. Many sectors, particularly those reliant on government support, could see volatility as parties debate key issues affecting economic growth.</p>\r\n<h4>2. The Yen’s Volatility</h4>\r\n<p>The yen's recent volatility has made Japanese equities less attractive to international investors. A stronger yen tends to lower profitability for exporters, which make up a substantial portion of Japan’s stock market. For instance, the auto and electronics sectors, which are particularly sensitive to currency fluctuations, may see fluctuating returns depending on how the yen behaves in the coming weeks.</p>\r\n<h3>What This Means for Investors in Asian Markets</h3>\r\n<p>Asian stocks often move in tandem with global trends, especially when there is potential for a shift in economic policies from major players like Japan. Investors should closely monitor Japan's election outcome and any policy announcements that might influence the yen's trajectory.</p>\r\n<p>To explore the historical trends and industry-specific performance that could provide additional context, investors can access <strong><a href=\"https://site.financialmodelingprep.com/developer/docs#sector-historical-market-overview\" target=\"_new\" rel=\"noopener\">Sector Historical</a></strong> data. This offers valuable insights into how similar events have impacted various sectors over time, helping investors make more informed decisions.</p>\r\n<h3>Potential Opportunities Amid Uncertainty</h3>\r\n<p>For investors seeking opportunities in the midst of Japan's fluctuating market, the following areas may offer potential:</p>\r\n<ul>\r\n<li><strong>Domestic-Focused Industries:</strong> Sectors that rely on local demand rather than exports may be less impacted by yen volatility and could present relatively stable investment options.</li>\r\n<li><strong>Dividend Stocks:</strong> Companies with strong balance sheets and a history of consistent dividend payouts may appeal to investors seeking income stability during market fluctuations.</li>\r\n</ul>\r\n<p>Additionally, tools like the <strong><a href=\"https://site.financialmodelingprep.com/developer/docs#economics-calendar-economics-data\" target=\"_new\" rel=\"noopener\">Economics Calendar</a></strong> can help investors keep track of upcoming economic events and announcements that may further affect the yen and broader Asian markets.</p>\r\n<h3>Conclusion</h3>\r\n<p>As Japan's election approaches and yen volatility persists, investors in Asia’s markets are adopting a cautious stance. By staying informed and leveraging resources for historical and economic data, investors can navigate these uncertain times with greater confidence and potentially uncover valuable opportunities in Japan and broader Asian markets.</p>",
    "tickers": "STOCK:ASEA",
    "image": "https://portal.financialmodelingprep.com//coverphotos/671b633432a6cab6f20f6698.png",
    "link": "https://financialmodelingprep.com/market-news/asia-stocks-muted-as-japanese-shares-decline-amid-election-and-yen-concerns",
    "author": "Parth Sanghvi",
    "site": "Financial Modeling Prep"
},
{
    "title": "Retail Investors Growing Less Bullish on Stocks: Insights from the Latest AAII Survey",
    "date": "2024-10-25 05:21:27",
    "content": "<p>Recent data from the American Association of Individual Investors (AAII) survey reveals a notable shift in sentiment among retail investors, who are showing decreased optimism toward the stock market. This change reflects increasing caution in response to market volatility, inflation concerns, and potential interest rate hikes, all of which contribute to a climate of uncertainty.</p>\r\n<h3>Why Are Retail Investors Becoming Less Bullish?</h3>\r\n<h4>1. Market Volatility and Economic Factors</h4>\r\n<p>Market uncertainty continues to impact investor confidence. Concerns about inflation, fluctuating interest rates, and the Federal Reserve's future policies have made investors cautious. With the ongoing possibility of rate hikes to curb inflation, many retail investors are re-evaluating their strategies, leaning towards safer asset classes or diversifying across different sectors.</p>\r\n<h4>2. Shifting Investment Preferences</h4>\r\n<p>The reduced bullish sentiment has prompted retail investors to explore alternatives beyond traditional stock markets. Commodities and bond markets are seeing renewed interest as investors seek stability. Additionally, emerging sectors such as green energy and technology continue to attract retail investors who are looking to capitalize on long-term growth trends rather than short-term gains in the stock market.</p>\r\n<p>For a more detailed understanding of these trends and to access data on investment preferences, <strong><a href=\"https://site.financialmodelingprep.com/developer/docs#revenue-product-segmentation-sales-revenue-by-segments\" target=\"_new\" rel=\"noopener\">Revenue Product Segmentation</a></strong> can provide insight into how different segments are performing within broader economic shifts.</p>\r\n<h3>What This Means for the Market</h3>\r\n<p>As retail investors grow more cautious, broader market dynamics could see a shift. With lower levels of retail enthusiasm, some sectors may experience slower growth rates. For instance:</p>\r\n<ul>\r\n<li><strong>Consumer Goods:</strong> Sectors like consumer goods may witness less buying activity as investors adopt a more conservative stance.</li>\r\n<li><strong>Growth Sectors:</strong> Technology and renewable energy sectors could still attract those seeking high growth potential but may face near-term fluctuations.</li>\r\n</ul>\r\n<p>Keeping track of industry-specific data, like <strong><a href=\"https://site.financialmodelingprep.com/developer/docs#bulk-ratings\" target=\"_new\" rel=\"noopener\">Bulk Ratings</a></strong>, can help investors and market analysts assess which sectors are receiving favorable ratings and may offer promising opportunities despite cautious retail sentiment.</p>\r\n<h3>Navigating an Evolving Market Landscape</h3>\r\n<p>Retail investors are becoming more strategic, adjusting their portfolios to manage risk amid fluctuating market conditions. This shift highlights the importance of data-driven decision-making for both new and seasoned investors. Staying informed on sector performance and market outlooks can help investors make smarter choices during periods of reduced market optimism.</p>",
    "tickers": "STOCK:SPY",
    "image": "https://portal.financialmodelingprep.com//coverphotos/671b631232a6cab6f20f6658.png",
    "link": "https://financialmodelingprep.com/market-news/retail-investors-growing-less-bullish-on-stocks-insights-from-the-latest-aaii-survey",
    "author": "Parth Sanghvi",
    "site": "Financial Modeling Prep"
}
]
